Repository: ArwaAlkadi/Wasalt2025
Catalog: Wasalt/*.lproj/Localizable.strings
Languages: ar

# station.kafd
source: KAFD
ar: المركز المالي (كافد)

# station.ar_rabi
source: Al Rabi
ar: الربيع

# station.uthman_bin_affan
source: Othman Bin Affan
ar: عثمان بن عفان

# station.sabic
source: SABIC
ar: سابك

# station.pnu1
source: PNU 1
ar: جامعة الأميرة نورة 1

# station.pnu2
source: PNU 2
ar: جامعة الأميرة نورة 2

# station.airport_t5
source: Terminal 5
ar: الصالة 5

# station.airport_t3_4
source: Terminal 3–4
ar: الصالة 3-4

# station.airport_t1_2
source: Terminal 1–2
ar: الصالة 1-2

source: OK
ar: حسناً

source: Cancel
ar: إلغاء

# onboarding.skip
source: Skip
ar: تخطي

# onboarding.next
source: Next
ar: التالي

# onboarding.done
source: Start!
ar: ابدأ!

# onboarding.title1
source: Safe Travel
ar: تنقّل آمن

# onboarding.subtitle1
source: We make your metro trips easier with simple steps.
ar: نسهّل عليك رحلاتك داخل المترو بخطوات بسيطة!

# onboarding.title2
source: Smart Alerts
ar: تنبيهات ذكية

# onboarding.subtitle2
source: We notify you with vibration and flash as you approach your station.
ar: ننبهك بالاهتزاز والوميض عند الاقتراب من محطتك.

# onboarding.title3
source: Travel with Confidence
ar: ابدأ رحلتك بثقة

# onboarding.subtitle3
source: Choose your destination and let the app track your metro route.
ar: اختر وجهتك ودع التطبيق يتابع خط سير المترو عنك.

# main.chooseDestination
source: Choose a Station
ar: اختر محطتك

# sheet.header
source: Hello!👋🏼 Where would you like to go?
ar: أهلاً! 👋🏼 وين ودك تروح؟

# sheet.startTrip
source: Start Trip
ar: ابدأ الرحلة

# sheet.status.notNearMetro
source: Move closer to the metro line to begin.
ar: قرب من خط المترو عشان تقدر تبدأ.

# sheet.status.noLocation
source: Cannot start the trip because your location is unavailable.
ar: ما نقدر نبدأ: موقعك غير معروف.

# sheet.status.chooseDestination
source: Please select a station first.
ar: اختر محطتك أولاً.

# status.alreadyAtDestination
source: You are already at your nearest station: %@
ar: أنت بالفعل في محطتك: %@

# lineSupport.notice
source: Only the Yellow Line is supported for now. More lines are coming soon.
ar: حالياً ندعم المسار الأصفر فقط — وباقي المسارات جاية قريب!

# tracking.eta
source: Estimated arrival time: %@ min
ar: الوقت المتوقع للوصول: %@ دقيقة

# tracking.start
source: Start
ar: البداية

# tracking.destination
source: Destination
ar: الوجهة

# tracking.change
source: Change Station
ar: بغير محطتي

# tracking.endTrip
source: End Trip
ar: إنهاء الرحلة

# arrival.title
source: You’ve arrived!
ar: وصلت محطتك!

# arrival.back
source: Back
ar: رجوع

# alert.approaching
source: Get ready! Approaching %@
ar: استعد! قربنا من %@

# alert.arrived
source: You have arrived at %@
ar: وصلت إلى %@

# permission.location.title
source: Enable Location
ar: فعّل الموقع

# permission.location.message
source: Location access is required to track your trip.
ar: التطبيق يحتاج إذن الوصول للموقع لمتابعة رحلتك.

# permission.openSettings
source: Open Settings
ar: فتح الإعدادات

# permission.notifications.title
source: Enable Notifications
ar: فعّل الإشعارات

# permission.notifications.message
source: Enable notifications so we can alert you upon arrival.
ar: فعّل الإشعارات حتى نقدر ننبهك عند الوصول.

# error.unknown
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. حاول مرة أخرى.

# trip.error.unknownLastStation
source: We couldn’t determine the last station you boarded from.
ar: ما قدرنا نعرف آخر محطة ركبت منها.

# trip.error.nearestStationNotFound
source: We couldn’t determine the nearest station to your location.
ar: ما قدرنا نحدد أقرب محطة.

# trip.arrived
source: You have arrived at your station: %@
ar: وصلت إلى محطتك %@
